/********************************* Copyright(c) ********************************
*
*                          LANMENG Scientific Creation
*                          https: //www.lmiracle.com
*
* File Name     : lm_test_uart.c
* Change Logs   :
* Date         Author      Notes
* 2019-06-07   terryall    V1.0    first version
*******************************************************************************/

/*******************************************************************************
* Description   : 文件包含区
*******************************************************************************/
#include "lm_driver_uart.h"
#include "lm_error.h"
#include "lm_app_config.h"

#include "lm_app.h"

/*******************************************************************************
* Description   : 模块内部函数定义区
*******************************************************************************/

/*******************************************************************************
* FunName       : lm_test_uart1_tx()
* Description   : 串口1发送数据
* EntryParam    : None
* ReturnValue   : 错误码
*******************************************************************************/
static int8_t lm_test_uart1_tx(void)
{
    lm_kprintf("========== lmiracle uart1 test ==========");

    return LM_ERR_SUCCESS;
}

/*******************************************************************************
* Description   : 注册3s应用程序任务
*******************************************************************************/
LM_APP_TASK_3S(lm_test_uart1_tx);

/* end of file */
