/********************************* Copyright(c) ********************************
*
*                          LANMENG Scientific Creation
*                          https: //www.lmiracle.com
*
* File Name     : lm_error.h
* Change Logs   :
* Date         Author      Notes
* 2019-06-07   terryall    V1.0    first version
*******************************************************************************/

/*******************************************************************************
* Description   : 文件包含区
*******************************************************************************/
#ifndef __LM_ERROR_H__
#define __LM_ERROR_H__

#include "lm_types.h"

/*******************************************************************************
* Description   : 宏定义区
*******************************************************************************/
#define LM_ERR_SUCCESS                 ( 0 )           /* 成功 */
#define LM_ERR_FAILED                  (-1 )           /* 失败 */
#define LM_ERR_MALLOC                  (-2 )           /* 申请内存失败 */

#endif

/* end of file */
